BetStreak/app/views/regs/show.html.erb

SELECT COUNT(*) FROM "regs" WHERE "regs"."contest_id" = ?  [["contest_id", 1]]
---
  <h1> The Game Will Appear Below When It Begins! </h1>
    <h2> Number of People Registered: <%= @contest.regs.count %> </h2>