BetStreak/app/controllers/questions_controller.rb

  def show
    @reg = Reg.find_by(id: params[:reg_id])
    @contest = @reg.contest
    @game = @reg.game
    @questions = @reg.game.questions.all
---
SELECT  "regs".* FROM "regs" WHERE "regs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "contests".* FROM "contests" WHERE "contests"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def index
    @reg = Reg.find_by(id: params[:reg_id])
    @contest = @reg.contest
    @game = @reg.game
    @questions = @reg.game.questions.all
---
SELECT  "regs".* FROM "regs" WHERE "regs"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."game_id" = ?  [["game_id", 2]]
SELECT "regs".* FROM "regs" WHERE "regs"."game_id" = ?  [["game_id", 2]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    #@race = Race.find_by(id: params[:id])
    @reg = Reg.find_by(id: params[:reg_id])
---
SELECT  "regs".* FROM "regs" WHERE "regs"."id" IS NULL LIMIT ?  [["LIMIT", 1]]