BetStreak/app/controllers/questions_controller.rb

SELECT  "regs".* FROM "regs" WHERE "regs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def start_page
    @reg = Reg.find_by(id: params[:reg_id])