BetStreak/app/controllers/regs_controller.rb

  def index
    @regs = Reg.all
---
SELECT "regs".* FROM "regs"