BetStreak/app/controllers/regs_controller.rb

SELECT "contests".* FROM "contests"
SELECT "games".* FROM "games"
---
  def new
    @reg = Reg.new
    @contests = Contest.all
    @games = Game.all

INSERT INTO "regs" ("datetime_registered", "approved", "user_id", "contest_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
     @reg = current_user.regs.build(reg_params)

     if @reg.datetime_registered < @reg.game.datetime_of_start
        @reg.approved = "Yes"
     else
        @reg.approved = "No"
     end

     if @reg.save

SELECT  "regs".* FROM "regs" WHERE "regs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @reg = Reg.find_by(id: params[:id])