BetStreak/app/controllers/sessions_controller.rb

  def create
     #find the user
     @user = User.find_by(username: params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "mark"], ["LIMIT", 1]]